model {
  faster_rcnn {
    num_classes: 2
    image_resizer {
      fixed_shape_resizer {
        height: 300
        width: 300
      }
    }
    feature_extractor {
      type: "faster_rcnn_resnet50"
    }
  }
}
train_config {
  batch_size: 4
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  num_steps: 10000
}
train_input_reader {
  label_map_path: "C:\\Users\\thore\\Documents\\GitHub\\ki\\KI-6\\test\\battery_label_map.pbtxt"
  tf_record_input_reader {
    input_path: "C:\\Users\\thore\\Documents\\GitHub\\ki\\KI-6\\train\\battery_train.tfrecord"
  }
}
eval_config {
  num_examples: 100
  metrics_set: "coco_detection"
}
eval_input_reader {
  label_map_path: "C:\\Users\\thore\\Documents\\GitHub\\ki\\KI-6\\test\\battery_label_map.pbtxt"
  tf_record_input_reader {
    input_path: "C:\\Users\\thore\\Documents\\GitHub\\ki\\KI-6\\valid\\battery_valid.tfrecord"
  }
}
